<template>
    <section class="questions py-[72px] xl:py-[40px]" id="you-get">
        <div class="content">
            <h2 class="text-[52px] font-bold xl:text-4xl">Часто задаваемые вопросы</h2>

            <el-collapse v-model="activeNames" @change="handleChange" class="mt-10">
                <el-collapse-item :title="'questions' + i" :name="i" v-for="(item,i) in questions">
                    <template #title>
                        <h3 class="font-[600] text-lg sm:text-sm text-left">{{ item.title }}</h3>
                    </template>
                    <p class="text-sm mt-4 font-open w-full px-4">{{ item.text }}</p>
                </el-collapse-item>
            </el-collapse>
        </div>
    </section>
</template>

<script>
export default {
    name: "QuestionsComponent",
    data() {
        return {
            questions: [
                {
                    title: "Что мне потребуется для прохождения курса?",
                    text: "Чтобы пройти курс, понадобится только компьютер. Вам необязательно иметь статус самозанятого, ИП или юрлица."
                },
                {
                    title: "Я никогда не работал с Wildberries. Мне подойдёт этот курс?",
                    text: "Чтобы успешно освоить это направление, вам понадобится базовое представление о маркетплейсах — что это такое и зачем выходить на онлайн-площадки. В остальном помогут опытные практикующие эксперты, которые будут сопровождать вас весь курс."
                },
                {
                    title: "Какой график обучения? Получится ли совмещать его с работой?",
                    text: "Вы можете изучать материалы курса в удобном вам режиме, совмещать обучение с работой и личной жизнью. Более того, все видео будут доступны и по окончании курса, так что вы сможете освежить свои знания в любой момент."
                },
                {
                    title: "Сколько часов в неделю мне нужно будет уделять курсу?",
                    text: "Зависит от того, насколько быстро вы хотите пройти курс. Чтобы сделать это за месяц, нужно заниматься по 2 часа в день. Но совсем не обязательно следовать жёсткому графику — учиться можно когда удобно. В среднем пользователи платформы занимаются от 3 до 5 часов в неделю."
                },
                {
                    title: "Кто будет мне помогать в обучении?",
                    text: "У вас будут проверяющие эксперты и куратор в чате курса. Все они — опытные менеджеры и селлеры с многомиллионными оборотами. Они прокомментируют практические работы, дадут полезные советы и ответят на любые вопросы. Вы сможете перенять их опыт, профессиональные знания и лайфхаки.\n" +
                        "\n" +
                        "Кстати, у вас есть возможность пообщаться с ними не только в чате, но и на индивидуальных онлайн-консультациях. Так вы получите ещё больше знаний, поддержки и персональных советов именно по вашим кейсам."
                },
                {
                    title: "Действуют ли какие-нибудь программы рассрочки?",
                    text: "Да, вы можете купить курс в рассрочку — и спланировать свой бюджет, разбив всю сумму на небольшие ежемесячные платежи."
                },
                {
                    title: "Могу ли я получить налоговый вычет за обучение?",
                    text: "Да, вы можете вернуть часть средств в виде налогового вычета. Основные условия: быть налоговым резидентом РФ и платить НДФЛ. Налоговый вычет составит до 13% от стоимости курса. Максимальная сумма возврата части НДФЛ — 15 600 рублей за год при цене курса 120 000 рублей.\n" +
                        "\n" +
                        "Вы можете вернуть средства через работодателя или налоговую.\n" +
                        "Для этого понадобится договор на обучение, наша лицензия на образовательную деятельность и чек об оплате курса, который придёт вам на почту или в личный кабинет банка.\n" +
                        "Если вы будете оформлять вычет через налоговую, нужно будет заполнить декларацию 3-НДФЛ. Удобнее всего это сделать в личном кабинете на сайте Федеральной налоговой службы.\n" +
                        "В течение 30 дней налоговая подтвердит ваше право на вычет.\n" +
                        "Если будете оформлять возврат части НДФЛ через работодателя, вам останется подать ему заявление о получении налогового вычета.\n" +
                        "\n" +
                        "Не переживайте, если процесс кажется вам сложным. Наши менеджеры помогут разобраться в том, как вернуть налоговый вычет."
                },
            ]
        }
    }
}
</script>

<style scoped>

</style>